Documents/ро_Отгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ро_Отгрузка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказНаряды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНарядИд</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборудованиеСтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОборудования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОстаткиОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиОборудования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказНарядИд</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборудованиеСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>дтСинхро</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНарядДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ро_Отгрузка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	Стк = Новый Структура;
	Стк.Вставить("Контрагент",Объект.Контрагент);
	
	оо = Новый ОписаниеОповещения("ПослеЗакрытияПодбора",ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.ОстаткиОборудования.Форма.ФормаСписка",Стк,ЭтаФорма,ЭтаФорма,,,оо,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПодбора(Рез,ДопПар) Экспорт
	
	Если типЗнч(рез)<>Тип("Массив") ТОгда Возврат; КонецЕСЛИ;
	
	Для каждого стк из Рез Цикл
		м = Объект.ЗаказНаряды.НайтиСтроки(Новый структура("ЗаказНарядИд",Стк.ЗаказНарядИд));
		Если м.Количество()<>0 Тогда Продолжить; КонецЕсли;
		новСтр = Объект.ЗаказНаряды.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр,стк);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМасКА()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ DISTINCT
	               |	ОстаткиОборудования.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.ОстаткиОборудования КАК ОстаткиОборудования";
	Мас = новый Массив;
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Мас.Добавить(Выб.Контрагент);
	КонецЦикла;
	
	Возврат Мас;
	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	текЭЛ = Элементы.Контрагент;
	текЭЛ.КнопкаВыпадающегоСписка = Истина;
	текЭл.СписокВыбора.ЗагрузитьЗначения(ПолучитьМасКА()); 
	текЭл.РедактированиеТекста = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка)=Ложь Тогда
		ДатаСинхронизации = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыгрузитьНаСервере(сс)
	// Вставить содержимое обработчика.
	Возврат глВыгрузкаДанных.ВыгрузитьРо_Отгрузку(сс);
КонецФункции

&НаКлиенте
Процедура Выгрузить(Команда)
	Если ЭтаФорма.Модифицированность = Истина Тогда
		Сообщить("Документ не записан!");
		Возврат;
	КонецеСЛИ;
	
	Если ВыгрузитьНаСервере(Объект.Ссылка)=Истина Тогда
		Объект.ДатаСинхронизации = ТекущаяДата();
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть();
	КонецеСЛИ;
КонецПроцедуры
